Revit 2027 API
ColorFillSchemeEntry.FillPatternId Property
 The id of fill pattern element of this entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId FillPatternId { get; set; }
Public Property FillPatternId As ElementId
	Get
	Set
public:
property ElementId^ FillPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member FillPatternId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
InvalidElementid represents no pattern, that means there would be nothing to be filled for elements colored based on this entry.
Only fill pattern elements whose fill pattern target is drafting is valid for color fill scheme.
See Also
Reference
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace